Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: Concurrent code without locks
ru: Параллельный код без блокировок

source: Condition
ru: Состояние

source: Condition is bool
ru: Состояние такое bool

source: Conditions are having the corresponding trait implementations
ru: Условия имеют соответствующие реализации trait

source: Consolidating types reduces the number of lifetime and safety invariants that must be maintained
ru: Объединение типов уменьшает количество инвариантов времени жизни и безопасности, которые необходимо поддерживать

source: const can be made mut
ru: const можно сделать mut

source: const can only be declared inside functions
ru: const могут быть объявлены только внутри функций

source: const NAME: Type = expr; - constants always have an explicit type and a constexpr value
ru: const ИМЯ: Type = expr; - константы всегда имеют явный type и значение constexpr

source: const requires explicit type annotation
ru: const требуется явная аннотация type

source: Constant out-of-range. 256 is outside u8 range
ru: Постоянная вне диапазона. 256 находится за пределами диапазона u8

source: constant PI = 3.14;
ru: постоянная PI = 3,14;

source: Constants can be modified
ru: Константы могут быть изменены

source: Constraint on references:
ru: Ограничение на ссылки:

source: Constraints (bounds) are written as T: Trait
ru: Ограничения (границы) записываются as T: Trait

source: Constructing objects with calls to a builder helper
ru: Конструирование объектов с помощью вызовов помощника builder

source: constructor
ru: конструктор

source: Constructor
ru: Конструктор

source: Consume self and return new type
ru: Употребляйте self и return новые type

source: Consumes the builder and creates the final object
ru: Потребляет конструктор и создает объект final

source: Contact
ru: Контакты

source: Continue
ru: Продолжить

source: Continue silently
ru: Продолжайте молча

source: Contract/invariant violation; dangerous/inconsistent values
ru: Нарушение договора/инварианта; опасные/несовместимые значения

source: Contracts are optional
ru: Контракты являются необязательными

source: Convenience function with its own error type
ru: Удобная функция с собственной ошибкой type

source: Convert them to String immediately
ru: Немедленно переведите их на сайт String

source: Convert to raw pointers immediately
ru: Немедленно преобразуйте в сырые указатели

source: Converted to integers and returned as codes
ru: Преобразование в целые числа и возвращение кодов as

source: Converting from String to &str is cheap and implicit thanks to deref coercion
ru: Преобразование из String в &amp;str является дешевым и неявным благодаря принуждению deref

source: Converting to panic!
ru: Превращение в панику!

source: Converting Vec to slice without reference
ru: Преобразование Vec в ломтик без ссылки

source: Converts async to sync
ru: Преобразование async в синхронизацию

source: Converts between two fixed types
ru: Преобразование между двумя фиксированными типами

source: Converts data structures back to Rust code
ru: Преобразование структур данных обратно в код Rust

source: Converts Ok into Err
ru: Преобразует Ok в Err

source: Converts Result to Option
ru: Преобразует Result на Option

source: Converts the error type into the function's error type
ru: Преобразует ошибку type в ошибку функции type

source: Converts to a panic
ru: Превращается в панику

source: Converts to Option
ru: Преобразуется в Option

source: Converts to Result
ru: Преобразуется в Result

source: Copies a value
ru: Копирует значение

source: Copies data
ru: Копирует данные

source: Copies only header and data
ru: Копирует только заголовок и данные

source: Copies only the pointer
ru: Копирует только указатель

source: Copies the value
ru: Копирует значение

source: Copy elision
ru: Copy элизия

source: Copy of data
ru: Copy данные

source: Countdown 3..1:
ru: Обратный отсчет 3..1:

source: Counter
ru: Счетчик

source: Cow only when it contains str
ru: Корова только тогда, когда она содержит str

source: CPU-bound are faster
ru: Работающие на процессоре быстрее

source: CPU-bound are limited by compute; IO-bound by I/O speed
ru: Ограниченные процессором ограничены вычислениями; ограниченные IO - скоростью ввода/вывода

source: CPU-bound saturate the CPU; IO-bound wait on I/O
ru: Связанные с процессором - насыщают процессор; связанные с IO - ждут ввода-вывода

source: CQS improves predictability by clearly distinguishing between commands and queries
ru: CQS повышает предсказуемость за счет четкого разграничения команд и запросов

source: CQS separates methods that change state (commands) from those that return data (queries)
ru: CQS разделяет методы, которые изменяют состояние (команды), и методы, которые return данные (запросы)

source: Crabs Animation
ru: Анимация крабов

source: Crates come in two types: binary (with main) and library (without main)
ru: Крейты бывают in двух типов: бинарные (с main) и библиотечные (без main)

source: create
ru: создать

source: Create
ru: Создать

source: Create a new type and validate in its constructor
ru: Создайте новый type и проверьте in его конструктор

source: Create default values
ru: Создание значений по умолчанию

source: Create multiple copies of data
ru: Создание нескольких копий данных

source: Create multiple instances of the same object
ru: Создание нескольких экземпляров одного и того же объекта

source: create_* functions
ru: функции create_*

source: Created via a macro
ru: Создается с помощью macro

source: Creates a copy
ru: Создает копию

source: Creates a log in stdout
ru: Создает журнал in stdout

source: Creates a new binary crate
ru: Создает новый двоичный файл crate

source: Creates a new crate
ru: Создает новый crate

source: Creates a new instance by changing some fields and copying the rest from another instance
ru: Создает новый экземпляр, изменяя некоторые поля и копируя остальные из другого экземпляра

source: Creates a new module
ru: Создает новый модуль

source: Creates a new OS thread
ru: Создает новый поток ОС

source: Creates a new Rectangle
ru: Создает новый прямоугольник

source: Creates a new task
ru: Создает новую задачу

source: Creates a new thread
ru: Создает новую тему

source: Creates a new thread and returns JoinHandle<T>
ru: Создает новый поток и возвращает JoinHandle<T>

source: Creates a timer
ru: Создает таймер

source: Creates a variable named _
ru: Создает переменную с именем _

source: Creates a weak reference
ru: Создает слабую ссылку

source: Creates an alias
ru: Создает псевдоним

source: Creates an array of values
ru: Создает массив значений

source: Creates array
ru: Создает массив

source: Creates C library
ru: Создает библиотеку C

source: Creates copy
ru: Создает копию

source: Creates infinite loop
ru: Создает бесконечность loop

source: Creates new futures
ru: Создает новое будущее

source: Creates new types dynamically
ru: Создает новые типы динамически

source: Creates range
ru: Создает диапазон

source: Creates reference
ru: Создает ссылку

source: Creates tuple
ru: Создает кортеж

source: Creating different types from polymorphic code
ru: Создание различных типов из полиморфного кода

source: Creating multiple instances quickly
ru: Быстрое создание нескольких экземпляров

source: Creating raw pointers is safe, but dereferencing requires unsafe block
ru: Создание сырых указателей безопасно, но разыменование требует блока unsafe

source: Creating specialized functions based on type reflection
ru: Создание специализированных функций на основе отражения type

source: CStr::from_ptr() creates a CStr from the pointer, then to_str() converts it to &str with UTF-8 validation
ru: CStr::from_ptr() создает CStr из указателя, затем to_str() преобразует его в &amp;str с проверкой UTF-8

source: CString with mut
ru: CString с mut

source: Currying allows partial application of functions, which Rust doesn't directly support
ru: Currying позволяет частично применять функции, что Rust напрямую не поддерживает

source: Custom derive macros generate code when using #[derive(YourMacro)]
ru: Пользовательские макросы derive генерируют код при использовании #[derive(YourMacro)]

source: Custom error types should use #[repr(C)] to ensure C-compatible memory layout
ru: Пользовательские типы ошибок должны use #[repr(C)], чтобы обеспечить C-совместимое расположение памяти

source: Cycles prevent reference counts reaching zero
ru: Циклы предотвращают достижение нулевого значения опорных отсчетов

source: Dangerous code that cannot be used
ru: Опасный код, который нельзя использовать

source: Dangling reference - object already dropped
ru: Висячая ссылка - объект уже упал

source: Data Collection
ru: Коллекция данных

source: Data freed, Weak::upgrade() returns None
ru: Данные освобождены, возвращается слабый::upgrade() None

source: Data from methods
ru: Данные из методик

source: Data inheritance
ru: Наследование данных

source: Data lives until last Weak
ru: Данные живут до последнего ослабления

source: Data not freed
ru: Данные не освобождены

source: Data race
ru: Гонка данных

source: Data types
ru: Типы данных

source: data User { … }
ru: данные Пользователь { ... }

source: DbC extends abstract data types with formal specifications that define expected behavior
ru: DbC расширяет типы данных abstract формальными спецификациями, определяющими ожидаемое поведение

source: dbg! always colors text
ru: dbg! всегда окрашивает текст

source: dbg! is enough
ru: dbg! достаточно

source: dbg! is handy for debugging. It prints and also returns the value
ru: dbg! - это удобный инструмент отладки for. Она печатает, а также возвращает значение

source: dbg! prints context + value. For debugging
ru: dbg! выводит контекст + значение. Для отладки

source: dbg! prints to stderr and returns the value
ru: dbg! выводит на stderr и возвращает значение

source: dbg! works only for numbers
ru: dbg! работает только с числами for

source: Deadlock (mutual blocking)
ru: Тупик (взаимная блокировка)

source: Deadlocks can occur with multiple locks
ru: Тупики могут возникать при наличии нескольких блокировок

source: Debug must be explicitly enabled. Without derive there's no debug output
ru: Debug должен быть явно включен. Без этого отладочная информация не выводится

source: Decides itself: by reference, by &mut, or by move
ru: Принимает решение самостоятельно: по ссылке, по &amp;mut, или по move

source: decimal
ru: десятичная

source: Declarative macros are created with macro_rules! and use pattern matching
ru: Декларативные макросы создаются с помощью macro_rules! и сопоставления шаблонов use

source: Declarative uses more memory
ru: Декларативный использует больше памяти

source: Declares a module
ru: Объявляет модуль

source: Decompose into smaller structs
ru: Разложите на более мелкие структуры

source: Decomposing structs allows borrowing fields independently, avoiding borrow checker conflicts
ru: Декомпозиция структур позволяет заимствовать поля независимо друг от друга, что позволяет избежать конфликтов при проверке заимствований

source: Decomposition often leads to discovering more logical separation of concerns
ru: Декомпозиция часто приводит к более логичному разделению задач

source: Deep copies data
ru: Глубокое копирование данных

source: Deep copy - duplicates the bytes
ru: Глубокое копирование - дублирование байтов

source: default fn foo();
ru: по умолчанию fn foo();

source: Default integer type:
ru: Default целое число type:

source: Default is i32
ru: Default это i32

source: Default trait method implementations allow code reuse
ru: Default trait реализации методов позволяют повторно использовать код

source: Default type for generic parameter
ru: Default type for общий параметр

source: Default type parameter is specified with syntax <PlaceholderType=ConcreteType>
ru: Default type параметр задается с помощью синтаксиса <PlaceholderType=ConcreteType>

source: Default values
ru: Default значения

source: defer
ru: отложить

source: defer keyword
ru: ключевое слово defer

source: Define algorithm skeleton at abstract level, separate specific implementations
ru: Определите скелет алгоритма на уровне abstract, отделите конкретные реализации

source: Define formal interface specifications with preconditions, postconditions and invariants
ru: Определение формальных спецификаций интерфейсов с предварительными условиями, постусловиями и инвариантами

source: Defines a method
ru: Определяет метод

source: Defines ABI for interacting with external code
ru: Определяет ABI for, взаимодействующий с внешним кодом

source: Defines an associated-function constructor
ru: Определяет конструктор ассоциированной функции

source: Defines behavior when going out of scope
ru: Определяет поведение при выходе за пределы области видимости

source: Delete
ru: Удалить

source: Deletes a task
ru: Удаление задачи

source: Deletes an entry
ru: Удаление записи

source: Deletes fields
ru: Удаляет поля

source: Deletes the future from memory
ru: Удаляет будущее из памяти

source: Deletes the hosting module
ru: Удаляет модуль хостинга

source: Deletes the key
ru: Удаляет ключ

source: Deletes the string
ru: Удаляет строку

source: Deletes the struct
ru: Удаляет struct

source: Deletes the value
ru: Удаляет значение

source: Deliberately copying data when needed
ru: Преднамеренное копирование данных при необходимости

source: Depend on concrete implementations
ru: Зависимость от конкретных реализаций

source: Depend upon abstractions, not concretions
ru: Зависит от абстракций, а не от конкретики

source: Dependencies should be circular
ru: Зависимости должны быть круговыми

source: Dependency Inversion
ru: Инверсия зависимостей

source: Dependency Inversion Principle (DIP)
ru: Принцип инверсии зависимостей (DIP)

source: Dependents are not important
ru: Иждивенцы не важны

source: depends
ru: зависит

source: Depends on Cargo.toml
ru: Зависит от Cargo.toml

source: Depends on condition
ru: Зависит от состояния

source: Depends on context
ru: Зависит от контекста

source: Depends on data type
ru: Зависит от данных type

source: Depends on function
ru: Зависит от функции

source: Depends on language
ru: Зависит от языка

source: Depends on operation
ru: Зависит от операции

source: Depends on platform
ru: Зависит от платформы

source: Depends on T
ru: Зависит от T

source: Depends on the runtime
ru: Зависит от времени выполнения

source: Depends on type
ru: Зависит от type

source: Depends on type of y
ru: Зависит от type от y

source: Depends on value
ru: Зависит от стоимости

source: Deprecated but still supported
ru: Утратил актуальность, но все еще поддерживается

source: Deprecated feature
ru: Утратившая актуальность функция

source: Deprecated macro type
ru: Утратившие актуальность macro type

source: Deprecated trait
ru: Утратившие актуальность trait

source: Deref
ru: Дереф

source: Deref allows &Vec<T> to automatically coerce to &[T], making slice methods available
ru: Deref позволяет &ampVec<T> автоматически коэрцитировать с &amp;[T], делая доступными методы срезов

source: Deref allows treating the guard like a pointer to the protected resource
ru: Deref позволяет обращаться с охранником как с указателем на защищаемый ресурс

source: Deref and DerefMut
ru: Deref и DerefMut

source: Deref coercion
ru: Дерефское принуждение

source: Deref coercion from String to str
ru: Перефразируйте принуждение с String на str

source: Deref is designed for custom pointers to convert pointer-to-T to T, not for inheritance
ru: Deref предназначен for пользовательских указателей для преобразования указателя на T в T, а не for наследования

source: Deref not implemented
ru: Deref не реализован

source: Deref polymorphism doesn't create subtyping relationships and doesn't automatically implement traits
ru: Полиморфизм Deref не создает отношения подтипирования и не реализует автоматически черты

source: Deref polymorphism is an anti-pattern where Deref is abused to simulate OO inheritance
ru: Полиморфизм Deref - это антипаттерн where Deref злоупотребляют для имитации наследования OO

source: Deref polymorphism is unexpected and uses implicit mechanisms that can confuse readers
ru: Полиморфизм Deref является неожиданным и использует неявные механизмы, которые могут запутать читателей

source: Deref polymorphism only supports single inheritance and has no interface concept
ru: Полиморфизм Deref поддерживает только одиночное наследование и не имеет концепции интерфейса

source: Deref::deref(&self) -> &Target describes what the type dereferences to
ru: Deref::deref(&amp;self) -&gt; &amp;Target описывает, на что ссылается type

source: Dereferencing custom smart pointers requires Deref
ru: Для разыменования пользовательских смарт-указателей требуется Deref

source: DerefMut allows dereferencing/coercing mutable references
ru: DerefMut позволяет разыменовывать/коэрцитировать мутабельные ссылки

source: Derive macro
ru: Вывести macro

source: Deserialize/Serialize trait, Visitor, and Deserializer
ru: Deserialize/Serialize trait , Visitor и Deserializer

source: Deserializer implements the format (JSON, TOML, etc.) and is driven by the Visitor
ru: Десериализатор реализует формат (JSON, TOML и т. д.) и управляется посетителем

source: Design Patterns
ru: Паттерны проектирования

source: Design Principles
ru: Принципы проектирования

source: Designed that way, but always deterministic
ru: Задумано так, но всегда детерминировано

source: Destructors (Drop trait)
ru: Деструкторы (Drop trait)

source: Destructors are not absolutely guaranteed - they won't run in infinite loops or when a panicking destructor causes an abort
ru: Деструкторы не являются абсолютно гарантированными - они не будут запускать in бесконечные циклы или когда паникующий деструктор вызывает прерывание

source: Destructors run automatically when an object goes out of scope, including during panics
ru: Деструкторы запускаются автоматически, когда объект выходит из области видимости, в том числе во время паники

source: Destructors run automatically when the value goes out of scope, ensuring cleanup
ru: Деструкторы запускаются автоматически, когда значение выходит за пределы области видимости, обеспечивая очистку

source: Destructuring extracts struct fields into separate variables
ru: Деструктуризация выделяет поля struct в отдельные переменные

source: Detached index breaks after clear() - no coupling to data
ru: Отсоединенный индекс разрушается после clear() - нет связи с данными

source: diesel for databases
ru: базы данных дизельных двигателей for

source: Difference between String::from("hi") and "hi".to_string()?
ru: Разница между String::from("hi") и "hi".to_string()?

source: Different concurrency paradigms
ru: Различные парадигмы параллелизма

source: Different impl blocks for different generic parameters
ru: Различные блоки impl for имеют разные общие параметры

source: Different ownership models
ru: Различные модели владения

source: Different types
ru: Разные типы

source: Different types allowed
ru: Допускаются различные типы

source: Different values for generic types cause different types which can have different implementations
ru: Различные значения for родовых типов приводят к появлению различных типов, которые могут иметь различные реализации

source: DIP states that high-level modules should not depend on low-level modules, both should depend on abstractions
ru: DIP утверждает, что модули высокого уровня не должны зависеть от модулей низкого уровня, оба должны зависеть от абстракций

source: Direct call value.drop() is forbidden; use free function drop
ru: Прямой вызов value.drop() запрещен; use свободная функция drop

source: Directly
ru: Непосредственно

source: Directly from anywhere
ru: Прямо из любого места

source: Disables borrow checker
ru: Отключает проверку займов

source: Disables stdout
ru: Отключает stdout

source: Disabling asserts
ru: Отключение ассертов

source: Diverging functions (e.g., with infinite loop or panic)
ru: Расходящиеся функции (например, с бесконечным loop или паникой)

source: Division rounds toward zero
ru: Деление округляется в сторону нуля

source: Do function pointers implement closure traits?
ru: Реализуют ли указатели функций черты закрытия?

source: Do most types implement Unpin automatically?
ru: Большинство ли типов реализуют функцию Unpin автоматически?

source: Do you always need to specify types in a closure?
ru: Всегда ли нужно указывать типы in в закрытии?

source: Documentation should be separate from code
ru: Документация должна быть отделена от кода

source: Documents macros
ru: Макросы документов

source: Does clone
ru: Делает клон

source: Does compiler check exhaustiveness with match guards?
ru: Проверяет ли компилятор исчерпываемость с помощью защит match?

source: Does Deref polymorphism introduce real subtyping?
ru: Вводит ли полиморфизм Deref настоящую подтипизацию?

source: Does flatmap
ru: Есть ли плоская карта

source: Does merge sort
ru: Выполняет ли сортировку слиянием

source: Does Rust support inheritance in the traditional sense?
ru: Поддерживает ли Rust наследование in в традиционном смысле?

source: Does the compiler check exhaustiveness in if let expressions?
ru: Проверяет ли компилятор исчерпываемость in if let выражений?

source: Does type alias provide type safety like newtype?
ru: Обеспечивает ли псевдоним type безопасность type, как newtype?

source: Does unsafe disable the borrow checker?
ru: Отключает ли unsafe проверку заимствований?

source: Doesn't compile
ru: Не компилируется

source: Doesn't implement Sync/Send
ru: Не реализует синхронизацию/отправку

source: Doesn't panic
ru: Не паникует

source: Doesn't store numbers
ru: Не сохраняет номера

source: Doesn't support multiplication
ru: Не поддерживает умножение

source: Doesn't work with |
ru: Не работает с |

source: Don't Repeat Yourself - every piece of knowledge must have a single representation
ru: Не повторяйтесь - каждая часть знаний должна иметь единственное представление

source: Don't Reuse Yourself
ru: Не используйте себя повторно

source: Don't use any lint attributes
ru: Не use атрибуты ворса

source: Don't use move keyword
ru: Не use move ключевое слово

source: Don't work with Vec
ru: Не работайте с Vec

source: Double free prevention
ru: Двойная бесплатная профилактика

source: Drop and Default
ru: Падение и Default

source: Drop ensures cleanup even on panic
ru: Капля обеспечивает очистку даже при панике

source: drop is called and the resource is released
ru: вызывается функция drop, и ресурс освобождается

source: Drop is implemented to free both the "box" and stored data
ru: Drop реализуется для освобождения как "box", так и хранящихся данных

source: Drop not implemented
ru: Падение не реализовано

source: drop(&mut self) is called automatically on destruction
ru: drop(&amp;mut self ) вызывается автоматически при уничтожении

source: Dropped
ru: Упал

source: DRY eliminates redundancy by ensuring single authoritative representations of knowledge
ru: DRY устраняет избыточность, обеспечивая единое авторитетное представление знаний

source: DRY ensures each piece of knowledge has a single, unambiguous, authoritative representation
ru: DRY обеспечивает единое, однозначное, авторитетное представление каждой части знаний

source: DST is a type whose size can only be known at runtime
ru: DST - это type, размер которого может быть известен только во время выполнения

source: DST must be used through pointer: &str, Box<str>, &dyn Trait, etc
ru: DST должен использоваться через указатель: &amp;str, Box&lt;str&gt;, &amp;dyn Trait и т.д

source: Duck type in a program
ru: Утка type in программа

source: Due to compiler limitation
ru: Из-за ограничений компилятора

source: Due to OS scheduler and lack of execution order guarantees
ru: Из-за планировщика ОС и отсутствия гарантий порядка выполнения

source: Due to println!
ru: Из-за println!
